app/views/tasks/index.html.erb

<table id="index_task_table">
  <% tasks = Task.all %>
---
SELECT "tasks".* FROM "tasks"