app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_task
    @task = Task.find(params[:id].to_i)

INSERT INTO "tasks" ("item", "description", "created_at", "updated_at", "due_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item", "read"], ["description", "poodr ch 4"], ["created_at", "2018-09-21 02:01:42.988263"], ["updated_at", "2018-09-21 02:01:42.988263"], ["due_date", "2018-09-21"]]
---
  def create
    @task = Task.new(item: params[:task][:item],
                     description: params[:task][:description],
                     due_date: params[:task][:due_date],
                     completion_date: nil)
    if @task.save

UPDATE "tasks" SET "item" = $1, "description" = $2, "completion_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["item", nil], ["description", nil], ["completion_date", nil], ["updated_at", "2018-09-20 05:52:31.802853"], ["id", 2]]
---
  def update
    # @task = Task.find(params[:id].to_i)
    # raise params.inspect
    if @task.update(item: params[:task][:item],
                    description: params[:task][:description],
                    due_date: params[:task][:due_date],
                    completion_date: params[:task][:completion_date])

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
---
  def destroy
    # @task = Task.find(params[:id].to_i)
    @task.destroy

UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-20"], ["updated_at", "2018-09-21 02:05:00.913389"], ["id", 1]]
---
  def complete
    # raise
    @task.update(completion_date: DateTime.now)

UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-21 02:05:08.800164"], ["id", 1]]
---
  def incomplete
    @task.update(completion_date: nil)